#Вы разработчик игр и работаете над новой фичей (функцией) для игры. 
#Сейчас надо реализовать логику работы сражений в игре. Во время сражения игрока 
#с противником каждый наносит удар. У кого сила удара больше, тот и нанес урон. 
#Напишите функцию, которая реализует эту логику. К сожалению, игра для старой 
#слабой платформы, где нет аппаратной поддержки операций сравнения. Поэтому надо 
#написать код без них. Разработчики аппаратуры подсказали, что можно использовать 
#бинарное представление чисел. 